Repository: richimf/K-MovieApp
Catalog: MovieApp/MovieApp/Localizable.xcstrings
Source language: en
Languages: es_419

source: Cancel
es_419: Cancelar

source: Loading more movies...
es_419: Cargando mas películas…

source: Loading Movie Details...
es_419: Cargando detalles…

source: Loading Movies...
es_419: Cargando Películas…

source: Movies
es_419: Películas

source: No Movie Data
es_419: No hay información de tu película

source: No Movies Found
es_419: No se encontraron peliculas

source: Release Date: %@
es_419: Fecha de estreno: %@

source: Retry
es_419: Reintentar

source: Search Movies...
es_419: Buscar Peliculas…
